Repository: ShiZhan/tech-trans-en-zh
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Graph processing" is one of many areas of big data research that make you feel like we've gone backwards in time.
zh_cn: 在大数据研究的众多领域中，"图处理" 是其中一个让你感觉好像我们返回旧时光的方向。

source: "We are at the beginning of exponential growth in digital intelligence." — Elon Musk, Tesla CEO
zh_cn: "我们正处在数字智能指数增长的开端"— — Elon Musk，特斯拉首席执行官

source: "[AI can] make every doctor as good as the best doctor in the world at diagnosing skin cancer." — Mark Zuckerberg, Facebook CEO
zh_cn: "[人工智能可以] 让每一位医生如同世界上最好的医师一样来诊断皮肤癌。" — Mark Zuckerberg, Facebook 首席执行官

source: ## Goals for 2016
zh_cn: ## 2016年目标

source: ## Progress in graph processing
zh_cn: ## 图形处理进展

source: ### Graph problems not graph algorithms.
zh_cn: ### 图问题不同于图算法。

source: ### Synchronous vs asynchronous graph processing
zh_cn: ### 同步与异步的图处理

source: ### Think like a computer scientist not a vertex
zh_cn: ### 像计算机科学家一样思考而非一个顶点

source: #### Community detection
zh_cn: #### 社区发现

source: #### Differential dataflow
zh_cn: #### 微分数据流

source: #### Graph coloring
zh_cn: #### 图的着色

source: #### Label propagation
zh_cn: #### 标签传播

source: * Creating new alphabets * Computers that dream about what they have learned * Algorithms that learn to generate their own music * AIs that generate fake images of people * Computers that draw pictures with different artistic styles
zh_cn: * 建立新的字母表 * 计算机用它们所学的内容做梦 * 用算法进行音乐创作 * 使用 AI 来合成虚拟图像 * 可以用不同艺术风格进行绘画的计算机

source: * Data analysis/data mining * Data warehousing * Online transaction processing * Virtualized infrastructure * Graph analytics * VDI
zh_cn: * 数据分析/数据挖掘 * 数据仓储 * 联机事务处理 * 虚拟化基础设施 * 图分析 * VDI

source: **Recommendation 1**: Authors of graph processing systems should be obliged to evaluate their implementations against other algorithms for the same problems.
zh_cn: ** 建议 1 **: 图处理系统的作者们应该有义务将其系统与解决同样的问题的其他算法相比较。

source: **Recommendation 2**: Authors of graph processing systems should be obliged to clearly distinguish the expressivity of their system from others.
zh_cn: ** 建议 2* *: 图处理系统的作者应该有义务清楚地将他们系统的表达性与别人区别开来。

source: ... a supervised learning technique that has been used in the closely related context of document classication, where it has been shown to have lower complexity and higher robustness than other learning methods.
zh_cn: ......一种监督的学习技术，被用于密切相关上下文的文档分类，并比其他的学习方法显示出较低的复杂度和更高的鲁棒性。

source: A decade ago, RAID vendors were having the same discussion when they were talking about front-end bandwidth (server to cache) vs. back-end bandwidth (cache to disk).
zh_cn: 十年前，RAID 供应商有过相同的讨论，关于前端带宽 （服务器到缓存） 与后端带宽 （缓存到磁盘）。

source: A graph coloring is an assignment of colors (think small integers) to graph nodes so that no edge references two nodes of the same color.
zh_cn: 图的着色是给图节点上色（可理解为小整数），同时保证没有一条边连接相同颜色的两个节点。

source: Accelerated research
zh_cn: 加快的研究

source: Again, this is a not-unreasonable trade-off if your algorithmic needs match the narrower interface, but not very helpful if you need to do something else.
zh_cn: 又一次，如果你的算法需要匹配的窄的接口，这还算不上一个不合理的折中，可是若要做些别的事情，那就并不非常有用。

source: All good, right?
zh_cn: 挺不错，是吧?

source: All graph processing systems can implement these algorithms, so in order to "have a fair comparison", a requirement of getting most papers published, you have to restrict your attention to this sort of problem.
zh_cn: 所有的图处理系统均可以实现这些算法，因此，为"有一个公平的比较"，作为多数论文发表的条件，你必须将注意力局限到这类问题。

source: All of these connectivity options are limited by PCIe bandwidth, and though that might change in the future, the issues will be the same: How much bandwidth is needed between the host server(s) and the storage system(s).
zh_cn: 所有这些连接选项都要受到 PCIe 带宽限制，虽然这在未来会有改变，问题仍将相同︰ 主机服务器和存储系统之间需要多少带宽。

source: All of this adds up to complexity that is hard to imagine and that people have spent careers trying to model.
zh_cn: 所有这一切加起来构成难以想象的复杂性，足以让人们用整个职业生涯来分析。

source: Already on github, there are 700+ unique projects using TensorFlow.
zh_cn: 在 github 上，已经有 700+ 基于 TensorFlow 的独特项目。

source: Already, TensorFlow is the most "popular" machine learning software: on github it has 19,000+ likes and 6,500+ forks.
zh_cn: TensorFlow 已经是最"流行"的机器学习软件 ︰ 在 github 上已有 19,000+ 赞、与 6,500+ 分支。

source: An interesting question for the future from the paper is “... whether storage capacity growth will fall behind data-growth rates, meaning that the standard model of storing all data forever will no longer be sustainable because of a shortage of available storage resources.” The chances of that are, in my estimation, close to certain.
zh_cn: 这篇论文向未来提出一个有趣的问题 "... 存储容量增长是否将落后于数据增长率，这意味着，由于可用存储资源的短缺，这种永远存储所有数据的标准模型将不可持续。" 其可能性是，据我估计，近乎必然。

source: And even now, there are new libraries coming online almost every week.
zh_cn: 即便是现在，仍然每周都有新面孔上线。

source: And if you don't believe me, look at what the top executives of the world's most forward-thinking companies are saying:
zh_cn: 如果你不相信我，看看世界上那些有着最前瞻思维的企业高管们都在说︰

source: And, of course, the simpler object storage interfaces of cloud vendors, who also remove most of the management overhead from corporate IT.
zh_cn: 并且，当然，云供应商所提供的简单对象存储接口，也为公司 IT 架构免除大多数管理开销。

source: Anecdotally, a great deal of Giraph (an open-source version of Pregel) vertex "programs" look more like state machines driven by decisions made by the computation's master node; the vertices do constitute a massively parallel data plane, but the program logic is still centralized.
zh_cn: 有趣的是，大量的 Giraph （Pregel-开源版） 顶点"程序"看起来更像由主计算节点决策驱动下的状态机，顶点确实构成一个大规模并行数据平面，但程序逻辑却仍然是集中化的。

source: Another painful aspect of development is that your code that runs on your development box often doesn't run on your production box because of GPU/CPU differences.
zh_cn: 另一个开发过程中的痛苦之处在于，在开发环境中可以运行的代码常常不能运行于生产环境，原因在于 GPU/CPU 上的差异。

source: Are these algorithms actually "representative graph problems", like the papers claim, and should we continue to improve the performance of these algorithms, assuming good general graph processing will come out of this work?
zh_cn: 这些算法是否确实如同这些论文所述 "代表图问题"，而且我们是否应该继续提高这些算法的性能，并认为一般性图处理可以由此改善？

source: As 2015 draws to a close, the research published at top venues still targets pretty much pagerank, connected components via label propagation, and breadth-first distance labeling.
zh_cn: 随着 2015 年临近尾声，发表在顶级会议上的研究仍然相当多的聚焦于 pagerank，基于标签传播的联通子图，和广度优先距离标签。

source: As a fun exercise, perhaps you could write down what you think would constitute progress?
zh_cn: 作个有趣的作业，也许你可以写下那些你认为可以促成进步的内容？

source: As devices get faster and faster, channel performance must keep up.
zh_cn: 随着设备越来越快、通道性能必须跟上。

source: As disk drives and solid state drives (SSDs) get faster and faster, I think it is time we stop and look at what really matters, namely, how much work gets done, not how fast a device is.
zh_cn: 随着磁盘驱动器和固态硬盘 (SSD) 越来越快，我认为现在是时候停下脚步审视一下什么才是真正重要的方面，换句话说，能完成多少工作，而非设备如何快。

source: As systems get bigger and namespaces get flatter, this problem is going to get even worse.
zh_cn: 随着系统变得更大和命名空间变得更宽阔，这个问题将变得更糟。

source: As the system watches human interaction with the data set, it learns what is important and tiers, protects and stores data according to user needs.
zh_cn: 随着系统观察人与数据集的交互，它学会如何判断重要性并根据用户需要来分层、保护和存储数据。

source: As the training set got larger, the accuracy for the smaller classes improved, reaching nearly 100 percent accuracy at around 30 percent of the training data included.
zh_cn: 随着训练集变得更大，较小分类精度持续提高，在训练数据的 30%左右可以达到近 100%的准确率。

source: At CIDR 2013, the [GRACE graph processing system](http://wenleix.github.io/paper/grace_cidr2013.pdf), no relation to [the other Grace graph processing system](https://www.usenix.org/system/files/conference/atc12/atc12-final182.pdf), presented a way to relax synchrony requirements in programs that otherwise look like bulk synchronous processors.
zh_cn: 在 CIDR 2013 上, [GRACE 图处理系统](http://wenleix.github.io/paper/grace_cidr2013.pdf), 与 [另外一个 Grace 图处理系统](https://www.usenix.org/system/files/conference/atc12/atc12-final182.pdf) 无关，提出一种方法来缓解同步需求，有别于成批同步处理模式 (bulk synchronous processors)。

source: Authors and reviewers should treat reduced expressivity as a serious concern, and expanded expressivity as a real contribution.
zh_cn: 作者和审阅者应将表达性削弱视为一个严重的问题，将表现性扩大作为真正的贡献。

source: Authors should go and check out the [GAP benchmark suite](https://github.com/sbeamer/gapbs), which targets simpler problems like those above, but provides optimized implementations using algorithms you probably haven't ever heard of.
zh_cn: 作者应该去查阅 [GAP benchmark suite] (https://github.com/sbeamer/gapbs)，其不仅以上面的那些简单问题为目标，更提供你可能还没听说过的优化算法。

source: Because the benchmark only requires the result, not a specific implementation, research and progress happened.
zh_cn: 由于这项基准测试只需要结果，不考察特定实现、研究乃至相应进展。

source: Because the file size is not known a priori by most applications and most file systems do not have a pre-allocation command, allocations between multiple files being open and written at the same time get interspersed with each other.
zh_cn: 因为对于大多数应用程序和文件系统而言，没有预分配命令，文件大小不可预知，多个文件同时打开写入数据将造成所分配空间相互交错。

source: Before TensorFlow
zh_cn: 在 TensorFlow 之前

source: Being a crap algorithm isn't the worst thing.
zh_cn: 作为一种没用算法还不是最糟糕的事情。

source: Better image recognition, better speech recognition, autonomous cars, beating GO masters, machines able to play and beat video games, and much much more.
zh_cn: 更好的图像识别，更准的语音识别，自动驾驶汽车，击败围棋大师，学习成为电子游戏高手，这样的例子还有许多。

source: Between file systems, volume managers and now object storage systems, how does data get allocated and laid out on the storage systems?
zh_cn: 文件系统、卷管理器以及现在还有对象存储系统，其间应如何分配数据，又怎样在存储系统中摆放？

source: But NVM is not a perfect replacement for DRAM, even ignoring latency.
zh_cn: 然而 NVM 并非 DRAM 的理想替换品，就算不考虑延迟。

source: But Xpoint DIMMS are coming soon, and neither will give you anything close to 1,000x performance boost.
zh_cn: 不过 Xpoint DIMMS 也快到来，而且没有哪个可以向你提供近 1,000 倍性能提升。

source: But even with new tools, such as graph databases, making sense of massive amounts of raw data is getting harder every day.
zh_cn: 然而即便是用上新工具，比方说图数据库，去处海量原始数据的难度依然与日俱增。

source: But getting back to my point: What matters is how much work you get done, not how fast your storage is, and faster storage does not always translate into more work getting done.
zh_cn: 不过现在返回出发点：真正重要的还是你能作多少事，而非存储如何快，更何况快速存储并不总是意味着能做更多事。

source: But the huge mass of users will take lower costs over the last possible IOP.
zh_cn: 但海量的普通用户仍将在满足所需 IOP 时尽可能降低成本。

source: But what are the implications of cheap IOPS for enterprise data center operations?
zh_cn: 但廉价 IOPS 于企业数据中心而言意味着什么？

source: By fixating only on the easiest of problems, researchers spiral into over-optimized and under-capable systems.
zh_cn: 由于仅聚焦于这类最简化问题，研究者们一直在过于优化与能力不足系统之间转圈。

source: CFOs who don’t know a switch from server can read AWS prices and put the heat on CIOs.
zh_cn: 不知道服务器开关在何处的首席财务官可以读 AWS 报价然后把任务转给首席信息官。

source: Cloud is the vise crushing EDC costs.
zh_cn: 云是影响企业数据中心成本的第二大要素

source: Cloud.
zh_cn: 云。

source: Commoditizing novel implementations of NVM – such as the hybrid memories this paper examines – will be a longer and more fraught process, but essential if we are to improve the efficiency and performance of all kinds of computer systems.
zh_cn: 将 NVM 的新颖实现商品化 – 比如说文中分析的混合存储 – 将会是一项长期且艰巨的任务，不过若我们希望改善各种计算机系统的效率与性能，那也非常关键。

source: Conclusion
zh_cn: 结论

source: Connectivity to Storage Systems The options for connectivity to the storage systems today are SAS, Infiniband, Fibre Channel and NVMe.
zh_cn: 存储系统连接 现在用于连接存储系统的选项有 SAS、Infiniband、光纤通道和 NVMe。

source: Cost.
zh_cn: 成本。

source: Courteous comments welcome, of course.
zh_cn: 欢迎礼貌讨论，当然。

source: Deep learning models can enable everyone to make novel combinations of algorithms and data to create applications that were not possible before.
zh_cn: 深学习模型让每个人能够尝试将新的算法和数据进行组合来创建应用程序，这在以往是不可能的。

source: Device Connectivity
zh_cn: 设备的连接

source: Establishing human trust in machine intelligence is a major domain problem – see Will Smith’s character in I, Robot.
zh_cn: 建立人类对机器智能的信任是一个主要的领域问题 — — 看看在《我，机器人》里面威尔 · 史密斯的角色。

source: Even for disk drives, the SAS layout on the storage controller can have one SAS lane saturated by four disk drives.
zh_cn: 甚至对于磁盘驱动器而言，存储控制器上的 SAS 布局中，四个磁盘驱动器就足以让一个 SAS 通道饱和。

source: Every researcher and company uses their preferred library.
zh_cn: 每个研究员和公司有着他们首选的程序库。

source: Everyone is handling much larger data stores now, so automation is a necessity.
zh_cn: 所有人正在面对越来越大的数据存储，自动化已成必需。

source: Everyone, including YOU, has the opportunity to create new and wonderful machine learning applications now.
zh_cn: 任何人，包括你，已经拥有创造新颖且美妙的机器学习应用的契机。

source: Everything is a potential bottleneck along the data path — from the number of applications to the file system (and let’s not forget the operating system!) to the PCIe bus to the channel all the way to the device.
zh_cn: 在数据路径上任何一处都是一个潜在的瓶颈 — — 从文件系统中应用的数量 （我们别忘记操作系统 ！） 到 PCIe 总线到通往设备的通道。

source: Except each storage medium has its issues and NVM is no exception.
zh_cn: 只不过每一种存储媒介都有它的问题，NVM 也不例外。

source: Existing file systems built for spinning or solid-state disks introduce software overheads that would obscure the performance that NVMs should provide, but proposed file systems for NVMs either incur similar overheads or fail to provide the strong consistency guarantees that applications require.
zh_cn: 现有用于旋转磁盘或固态盘的文件系统所带来的软件开销将会削弱 NVM 原本应该提供的性能，然而现在为 NVM 设计的文件系统要么也有相似的开销，要么无法提供应用需要的强一致性保证。

source: Experimental results
zh_cn: 实验结果

source: Experimental results show that in write-intensive workloads, NOVA provides 22% to 216× throughput improvement compared to state-of-the-art file systems, and 3.1× to 13.5× improvement compared to file systems that provide equally strong data consistency guarantees.
zh_cn: 实验结果展示出就写密集负载而言，NOVA 可以提供比现有文件系统高出 22% 直至 216 倍的性能提升，而且即便与提供相同强一致性保障的文件系统相比，性能也有 3.1 倍到 13.5 倍的提升。

source: Fallibility will always be part of an AI’s nature.
zh_cn: 易错性总会是人工智能本质的一部分。

source: Faster storage requires re-engineering the back-end storage system to ensure that there is enough bandwidth so each storage device can run at full rate.
zh_cn: 更快的存储需要重新设计的后端存储系统以确保提供足够的带宽，使每个存储设备可以全速运转。

source: Feel free to contact us.
zh_cn: 欢迎与我们联系。

source: First things Is data center storage getting simpler?
zh_cn: 第一件事 数据中心存储正变得更简单？

source: Flash makes high performance a given.
zh_cn: 闪存直接就能提供高性能。

source: Flash.
zh_cn: 闪存。

source: For IBM, a world leader in AI, as their success with Watson has demonstrated, applying intelligence to the problem of storage is a natural application.
zh_cn: 就 IBM 而言，作为人工智能 (AI) 的领导者，基于在 Watson 上所展现出来的成功，将智能性应用在存储问题上是自然之选。

source: For an alternate approach, consider the [graph500 benchmark](http://www.graph500.org), originally conceived as a way to evaluate memory subsystems.
zh_cn: 作为另一种方法，请考虑 [graph500 基准] (http://www.graph500.org)，最初被视为一种内存子系统评价方法。

source: For an interesting overview of the Gödel Machine, deep learning, and how a program can rewrite itself while running, Schmidhuber’s lecture is an excellent introduction.
zh_cn: Schmidhuber 的讲座为哥德尔机、深度学习，以及程序如何在运行时重写自身提供了一个不错的有趣介绍。

source: For each new paper that is published in machine learning, it is usually followed by several open source implementations each written in a different framework and only meant to run on a specific hardware.
zh_cn: 在每一篇发表于机器学习领域的新论文中，总包含着几个开放源码实现，各自用不同的框架所写，只运行于特定的硬件上。

source: For example, [PowerGraph](https://www.usenix.org/system/files/conference/osdi12/osdi12-final-167.pdf) introduced the Gather, Apply, Scatter (GAS) interface, which allows one to program input combiners, vertex logic, and disemination.
zh_cn: 例如，[PowerGraph] (https://www.usenix.org/system/files/conference/osdi12/osdi12-final-167.pdf) 介绍了 Gather, Apply, Scatter (GAS) 接口，允许用户就输入组合生成器、 顶点逻辑和传播方式编程。

source: For example, if you have a standard POSIX file system, the file system’s allocation policy is first in first out (FIFO).
zh_cn: 例如，如果你有一个标准的 POSIX 文件系统，文件系统的空间分配策略是先入先出 (FIFO)。

source: For those coming in late, the upcoming NVM technologies, of which Xpoint is only one, promise faster writes, higher endurance, and greater longevity than the NAND flash used in today’s SSDs.
zh_cn: 如果原来不是很清楚，发展中的 NVM 技术里，Xpoint 只是其中之一，具备更快的写操作，更高的耐久性，以及比现在固态盘中使用的 NAND flash 更高的使用寿命。

source: From Jian’s abstract: ... managing, accessing, and maintaining consistency for data stored in NVM raises a host of challenges.
zh_cn: 在 Jian 的摘要中: ... 管理，访问，和维护保存在 NVM 中数据的一致性引出不少挑战。

source: From the abstract of the paper A Family of Gödel Machine Implementations by Bas R. Steunebrink and Jürgen Schmidhuber of the IDSIA & University of Lugano:
zh_cn: 这篇论文《一类哥德尔机的实现》(A Family of Gödel Machine Implementations) 由来分别来自于 IDSIA 和 Lugano 大学的 Bas R. Steunebrink 和 Jürgen Schmidhuber 完成，其摘要里说：

source: Goodbye, old bottleneck
zh_cn: 再见了，老的瓶颈

source: Google is also relentlessly releasing updates, supporting products, and training courses.
zh_cn: 谷歌还在持续地发布更新，提供产品支持和培训课程。

source: Graph processing systems have introduced progressively more restrictive APIs in the name of performance, creating a race to the bottom with respect to expressivity.
zh_cn: 图处理系统已经以性能的名义逐步引进更严格的 APIs，造成一场追逐表达性的竞争。

source: Gödel Machines, deep learning and the limits of AI by ROBIN HARRIS on WEDNESDAY, 13 JANUARY, 2016 If, like me, you’re interested in AI and deep learning, you’ll like this.
zh_cn: 哥德尔机器、深度学习和人工智能的极限 罗宾 · 哈里斯 星期三 2016 年 1 月 13 日 如果像我一样，你对人工智能(AI)和深度学习(Deep Learning)有兴趣，你会喜欢这贴。

source: Gödel machines run on von Neumann architectures – they are not a new computer architecture.
zh_cn: 哥德尔机可以在冯 · 诺依曼体系结构上运行 — — 他们不是一个新的计算机体系结构。

source: Here are my thoughts on why the area isn't making very much progress, and is in some cases regressing, as well as a few proposals for making thing better.
zh_cn: 这里我谈一些我的想法，为什么这个区域没有实现什么进展，并且在某些情况下还有所退步，以及提几个改进建议。

source: Host Side
zh_cn: 主机端

source: How AI will change everything
zh_cn: AI 将如何改变一切

source: However, in my mind the most interesting thing to happen with graph500 was [Scott Beamer](http://www.cs.berkeley.edu/~sbeamer/research.html) and friends observing that a tweaked algorithm could traverse fewer edges, accomplishing the same result but moving less data over the memory subsystem.
zh_cn: 然而，在我的印象中发生在 graph500 上最有趣的事情莫过于 [Scott Beamer] (http://www.cs.berkeley.edu/~sbeamer/research.html)，据朋友们观察，一项调整的算法可以通过遍历更少的边以实现相同的结果，从而在内存子系统移动较少的数据。

source: However, the fixation on known problems (pagerank, connectivity, etc) leads us towards more and more restrictive programming models.
zh_cn: 然而，执着于已知问题 （pagerank、 连通性等） 又将方向引至受更多限制的编程模型。

source: I do not think the main problem with graph processing systems is that they do not yet compute PageRank fast enough; I think the problem is that they mostly just compute PageRank.
zh_cn: 我不认为图处理系统的主要问题是，他们计算 PageRank 还不够快，我觉得问题是，他们大多只计算 PageRank。

source: I n October 2015, Google released a piece of machine learning software called TensorFlow.
zh_cn: 2015 年 10 月，Google 发布了一款名为 TensorFlow 的机器学习软件。

source: I've spoken with dozens of research labs over the past few months and most are already moving to TensorFlow or exploring moving to it.
zh_cn: 在过去的几个月里我与不少研究实验室交流过，大部分都已经将自己的工作迁移上 TensorFlow 或正在尝试使用它。

source: IB, essentially, relates the information’s metadata values to cognitive system relevance values with the goal of preserving the mutual information between the two.
zh_cn: IB，本质上，为信息的元数据价值，与认知系统相关值建立关联，目的是保持两者之间的互信息。

source: IBM researchers are proposing – and demoing – an intelligent storage system that works something like your brain.
zh_cn: IBM 提出 – 和展示 – 一款可以如大脑一般运作的智能存储系统.

source: IBM’s Watson runs on a massively parallel system, and I assume a Gödel Machine can too.
zh_cn: IBM 的沃森(Watson)运行在大规模并行系统上，我认为哥德尔机也可以。

source: If in one case you have a single application writing say 500 GB in 1 MB chunks sequentially, and if you have enough free space, the file will be allocated with sequential block addresses in the file system.
zh_cn: 如果在一个案例中你有一个应用程序按照 1 MB 块大小顺序写 500 GB 1 MB 数据，而且如果你有足够的可用空间，该文件将在文件系统中被分配连续块地址。

source: If two applications are writing two different 500 GB files, then it is almost certain that the files will not be sequentially allocated on a disk, given that file systems allocate data based on their allocation policy, which could pre-allocate ahead but certainly not 500 GB.
zh_cn: 如果两个应用程序分别写两个不同的 500 GB 文件，那么就几乎可以肯定不会在磁盘上按顺序分配，考虑到文件系统是按照其分配策略分配数据，有可能预先分配空间，不过肯定没有 500 GB。

source: If you are at all interested in machine learning, I suggest you start hacking on top of TensorFlow.
zh_cn: 若你对机器学习有兴趣，我建议你从 TensorFlow 开始。

source: If you want to better understand what the latest research and techniques that are being used to understand workflows and how that impacts system performance and systems architecture, I suggest you pack your bags and head to Santa Clara for MSST.
zh_cn: 如果你想要更好地理解最新的研究工作和那些正被用来认识工作流及其如何影响系统性能和系统体系结构的技术，我建议你收拾行囊去圣塔克拉拉参加 MSST。

source: If your storage systems are due a refresh and you are planning future purchases, then there's a huge elephant in the room that needs addressing: Intel and Micron's high performance 3D XPoint technology.
zh_cn: 如果你的存储系统需要更新而且你正在计划未来的采购，那现在这里就有一个重磅消息值得关注︰ 英特尔和镁光的高性能 3D XPoint 技术。

source: If you’re processing IoT data sets, the storage system’s AI would have processed what is important about prior data sets and apply those criteria – access frequency, protection level, divergence from norms, time value, – to the incoming data.
zh_cn: 如果您正在处理物联网数据集, 存储系统 AI 将在处理之前的数据集时分析出其重要性并且将有关特性 — — 访问频率、保护级别、偏离度、时间价值 — — 应用于未来的数据。

source: Imagination and experimentation are the fuel that will create intelligence that we have never seen before.
zh_cn: 想象力和实验将为开展前所未见的智能创作提供燃料。

source: In Cognitive Storage for Big Data (paywall), IBM researchers Giovanni Cherubini, Jens Jelitto, and Vinodh Venkatesan, of IBM Research—Zurich, described their prototype system.
zh_cn: 在《认知存储大数据》 （付费）上，来自 IBM 苏黎世研究所的研究人员 Giovanni Cherubini, Jens Jelitto 和 Vinodh Venkatesan，描述了其原型系统。

source: In a recent paper, NOVA: A Log-structured File System for Hybrid Volatile/Non-volatile Main Memories Jian Xu and Steven Swanson of the University of California, San Diego, discuss NVM integration issues.
zh_cn: 在最近一篇论文，NOVA: A Log-structured File System for Hybrid Volatile/Non-volatile Main Memories 中，来自加州大学圣迭戈分校的 Jian Xu 与 Steven Swanson 探讨了 NVM 集成问题。

source: In particular, it maintains separate logs for each inode to improve concurrency, and stores file data outside the log to minimize log size and reduce garbage collection costs.
zh_cn: 特别的，它还为每一个 inode 分别维护日志以提高并行性，而且将文件数据保存在日志之外来最小化日志尺寸，减少垃圾回收代价。

source: Integrating 3D Xpoint with DRAM by Robin Harris on Monday, 21 March, 2016 Intel is promising availability of 3D Xpoint non-volatile memory (NVM) this year, at least in their Optane SSDs.
zh_cn: 将 3D Xpoint 与 DRAM 整合 作者 Robin Harris 于 星期一, 2016 年 3 月 21 日 Intel 承诺将于今年发售 3D Xpoint 非易失存储器 (NVM), 至少在他们的 Optane 固态盘中.

source: Is it hype?
zh_cn: 它是炒作吗？

source: Is the storage admin an endangered species?
zh_cn: 存储管理员就要成濒危物种啰？

source: Is this going to work at enterprise scale or will it be a purely web-scale service?
zh_cn: 是否在在企业规模适用或它将成为一个纯粹的互联网尺寸服务？

source: It is a cute idea that has some cachet, and appears to make the complexity of graph processing a bit more manageable.
zh_cn: 它是一个可爱的想法，有较好的口碑，而且似乎使图形处理的复杂性有点更易于管理。

source: It is great that there is all this experimentation with different interfaces, but there needs to be consolidation if we want to move faster.
zh_cn: 为不同的接口都开展实验，那是很不错，但如果我们想要运行的更快，还需要整合。

source: It is harder to evaluate expressivity than raw performance, but it is absolutely the most interesting research direction at the moment.
zh_cn: 比起纯粹性能而言更难评价表现性，但它绝对是目前最有趣的研究方向。

source: It is the second-generation software for machine learning infrastructure built at Google, and it powers many of their products such as Google Inbox, Google Translator, Youtube, Google Ads, and more.
zh_cn: 这是 Google 开发的第二款用于机器学习的基础架构软件，而且已经被用于诸如 Google 收件箱，Google 翻译，Youtube，Google 广告等产品。
